In [1]:
import pandas as pd

df = pd.read_csv(r"D:\courses\Udemy - Data Analysis with Pandas and Python data\All the Files\bigmac.csv",parse_dates=['Date'])

df.head()

        Date    Country  Price in US Dollars
0 2016-01-01  Argentina                 2.39
1 2016-01-01  Australia                 3.74
2 2016-01-01     Brazil                 3.35
3 2016-01-01    Britain                 4.22
4 2016-01-01     Canada                 4.14

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 652 entries, 0 to 651
Data columns (total 3 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date                 652 non-null    datetime64[ns]
 1   Country              652 non-null    object
 2   Price in US Dollars  652 non-null    float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 15.4+ KB

In [3]:
df['Country'].unique()

array(['Argentina', 'Australia', 'Brazil', 'Britain', 'Canada', 'Chile',
       'China', 'Colombia', 'Costa Rica', 'Czech Republic', 'Denmark',
       'Egypt', 'Euro area', 'Hong Kong', 'Hungary', 'India', 'Indonesia',
       'Israel', 'Japan', 'Malaysia', 'Mexico', 'New Zealand', 'Norway',
       'Pakistan', 'Peru', 'Philippines', 'Poland', 'Russia',
       'Saudi Arabia', 'Singapore', 'South Africa', 'South Korea',
       'Sri Lanka', 'Sweden', 'Switzerland', 'Taiwan', 'Thailand',
       'Turkey', 'UAE', 'Ukraine', 'United States', 'Uruguay',
       'Venezuela', 'Vietnam', 'Austria', 'Belgium', 'Estonia', 'Finland',
       'France', 'Germany', 'Greece', 'Ireland', 'Italy', 'Netherlands',
       'Portugal', 'Spain', 'Lithuania', 'Latvia'], dtype=object)

In [4]:
df['Country'].nunique()

58

<br>
______________________________________________________________________________________________________________________________

# Creating Multi-Index DataFrame

In [5]:
df.set_index("Date")

                  Country  Price in US Dollars
Date
2016-01-01      Argentina                 2.39
2016-01-01      Australia                 3.74
2016-01-01         Brazil                 3.35
2016-01-01        Britain                 4.22
2016-01-01         Canada                 4.14
...                   ...                  ...
2010-01-01         Turkey                 3.83
2010-01-01            UAE                 2.99
2010-01-01        Ukraine                 1.83
2010-01-01  United States                 3.58
2010-01-01        Uruguay                 3.32

[652 rows x 2 columns]

In [8]:
# If we want to set 2 index's

df.set_index(keys = ["Country","Date"])

                          Price in US Dollars
Country       Date
Argentina     2016-01-01                 2.39
Australia     2016-01-01                 3.74
Brazil        2016-01-01                 3.35
Britain       2016-01-01                 4.22
Canada        2016-01-01                 4.14
...                                       ...
Turkey        2010-01-01                 3.83
UAE           2010-01-01                 2.99
Ukraine       2010-01-01                 1.83
United States 2010-01-01                 3.58
Uruguay       2010-01-01                 3.32

[652 rows x 1 columns]

In [9]:
# If we want to set 2 index's

df.set_index(keys = ["Date", "Country"], inplace=True)

In [10]:
df.head()

                      Price in US Dollars
Date       Country
2016-01-01 Argentina                 2.39
           Australia                 3.74
           Brazil                    3.35
           Britain                   4.22
           Canada                    4.14

In [12]:
df.sort_index(inplace=True)

In [13]:
df.head()

                      Price in US Dollars
Date       Country
2010-01-01 Argentina                 1.84
           Australia                 3.98
           Brazil                    4.76
           Britain                   3.67
           Canada                    3.97

In [14]:
df.index

MultiIndex([('2010-01-01',      'Argentina'),
            ('2010-01-01',      'Australia'),
            ('2010-01-01',         'Brazil'),
            ('2010-01-01',        'Britain'),
            ('2010-01-01',         'Canada'),
            ('2010-01-01',          'Chile'),
            ('2010-01-01',          'China'),
            ('2010-01-01',       'Colombia'),
            ('2010-01-01',     'Costa Rica'),
            ('2010-01-01', 'Czech Republic'),
            ...
            ('2016-01-01',    'Switzerland'),
            ('2016-01-01',         'Taiwan'),
            ('2016-01-01',       'Thailand'),
            ('2016-01-01',         'Turkey'),
            ('2016-01-01',            'UAE'),
            ('2016-01-01',        'Ukraine'),
            ('2016-01-01',  'United States'),
            ('2016-01-01',        'Uruguay'),
            ('2016-01-01',      'Venezuela'),
            ('2016-01-01',        'Vietnam')],
           names=['Date', 'Country'], length=652)

In [15]:
df.index.names

FrozenList(['Date', 'Country'])

In [16]:
type(df.index)

pandas.core.indexes.multi.MultiIndex

In [17]:
df.index[0]

(Timestamp('2010-01-01 00:00:00'), 'Argentina')